dev/vllm/benchmarks/phase1-batch16k/20260225-025656/rate-5.0.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f699881c220>, seed=0, num_prompts=300, dataset_name='sharegpt', no_stream=False, dataset_path='/models/benchmarks/conversations-sharegpt-20260224-205203.json', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/nvidia/Llama-3.1-70B-Instruct-FP8', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/models/benchmarks/phase1-batch16k/20260225-025656', result_filename='rate-5.0.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-490247ca-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 300/300 [02:03<00:00,  2.42it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  123.85    
Total input tokens:                      1741762   
Total generated tokens:                  156719    
Request throughput (req/s):              2.42      
Output token throughput (tok/s):         1265.35   
Peak output token throughput (tok/s):    2018.00   
Peak concurrent requests:                188.00    
Total token throughput (tok/s):          15328.31  
---------------Time to First Token----------------
Mean TTFT (ms):                          407.94    
Median TTFT (ms):                        319.76    
P50 TTFT (ms):                           319.76    
P95 TTFT (ms):                           972.33    
P99 TTFT (ms):                           1196.80   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          88.53     
Median TPOT (ms):                        89.89     
P50 TPOT (ms):                           89.89     
P95 TPOT (ms):                           106.26    
P99 TPOT (ms):                           108.27    
---------------Inter-token Latency----------------
Mean ITL (ms):                           86.51     
Median ITL (ms):                         90.40     
P50 ITL (ms):                            90.40     
P95 ITL (ms):                            106.23    
P99 ITL (ms):                            430.60    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          45511.45  
Median E2EL (ms):                        52420.43  
P50 E2EL (ms):                           52420.43  
P95 E2EL (ms):                           90300.83  
P99 E2EL (ms):                           93508.74  
==================================================